weedmanu/STM32_Libraries/STM32_WifiESP_Alexa/STM32_WifiESP_Alexa.c
/*
 * STM32_WifiESP_Alexa.c
 * Driver STM32 <-> ESP01 (AT)
 * Version Final V1.0
 * 2025 - manu
 */

// ==================== INCLUDES ====================

#include "STM32_WifiESP_Alexa.h" // Fichier d'en-tête principal du driver
#include "udp_ssdp.h"			 // Inclure pour le handler UDP

// ==================== DÉFINITIONS & MACROS ====================

#ifndef VALIDATE_PARAM
#define VALIDATE_PARAM(expr, ret) \
	do                            \
	{                             \
		if (!(expr))              \
			return (ret);         \
	} while (0)
#endif

#define ESP01_CONN_TIMEOUT_MS 30000 // Timeout pour les connexions (30 secondes)

// ==================== VARIABLES GLOBALES ====================

esp01_stats_t g_stats = {0};								  // Statistiques globales du driver
connection_info_t g_connections[ESP01_MAX_CONNECTIONS] = {0}; // Tableau des connexions actives
int g_connection_count = 0;									  // Nombre de connexions actives
uint16_t g_server_port = 80;								  // Port du serveur web
const ESP01_WifiMode_t g_wifi_mode = ESP01_WIFI_MODE_AP;	  // ou ESP01_WIFI_MODE_STA selon ton mode voulu

// ==================== VARIABLES INTERNES ====================
UART_HandleTypeDef *g_esp_uart = NULL;				  // UART principal pour l'ESP01 (exposé pour UDP)
UART_HandleTypeDef *g_debug_uart = NULL;			  // UART pour le debug (exposé pour UDP)
static uint8_t *g_dma_rx_buf = NULL;				  // Buffer DMA RX
static uint16_t g_dma_buf_size = 0;					  // Taille du buffer DMA RX
static volatile uint16_t g_rx_last_pos = 0;			  // Dernière position lue dans le buffer DMA RX
static char g_accumulator[ESP01_DMA_RX_BUF_SIZE * 2]; // Accumulateur global pour les données reçues
static uint16_t g_acc_len = 0;						  // Longueur actuelle de l'accumulateur
static volatile bool g_processing_request = false;	  // Indique si une requête est en cours de traitement
static esp01_route_t g_routes[ESP01_MAX_ROUTES];	  // Tableau des routes HTTP enregistrées
static int g_route_count = 0;						  // Nombre de routes HTTP enregistrées

// Etat de parsing des données reçues
typedef enum
{
	PARSE_STATE_SEARCHING_IPD,
	PARSE_STATE_READING_HEADER,
	PARSE_STATE_READING_PAYLOAD
} parse_state_t;

// État de parsing actuel
static parse_state_t g_parse_state = PARSE_STATE_SEARCHING_IPD;

/***************************************************************/
// Fonctions internes utilisées par le driver ESP01
/***************************************************************/
/**
 * @brief Affiche un message de debug sur l'UART de debug si activé.
 * @param msg Chaîne C terminée par '\0' à afficher.
 */
void _esp_logln(const char *msg)
{
	if (ESP01_DEBUG && g_debug_uart && msg) // Si debug activé et UART debug disponible
	{
		HAL_UART_Transmit(g_debug_uart, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY); // Envoie le message
		HAL_UART_Transmit(g_debug_uart, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);		 // Ajoute un retour à la ligne
	}
}

/**
 * @brief Calcule la position actuelle d'écriture du DMA dans le buffer circulaire.
 * @return Position d'écriture (offset dans le buffer DMA).
 */
static uint16_t _get_dma_write_pos(void)
{
	return g_dma_buf_size - __HAL_DMA_GET_COUNTER(g_esp_uart->hdmarx); // Position d'écriture dans le buffer circulaire
}

/**
 * @brief Calcule le nombre de nouveaux octets disponibles dans le buffer DMA.
 * @return Nombre d'octets disponibles à lire.
 */
static uint16_t _get_available_bytes(void)
{
	uint16_t write_pos = _get_dma_write_pos();				 // Récupère la position actuelle d'écriture du DMA
	if (write_pos >= g_rx_last_pos)							 // Si la position d'écriture est après ou égale à la dernière position lue
		return write_pos - g_rx_last_pos;					 //   -> Nombre d'octets disponibles = différence directe
	else													 // Sinon (le buffer a "tourné" en mode circulaire)
		return (g_dma_buf_size - g_rx_last_pos) + write_pos; //   -> Nombre d'octets = fin du buffer + début du buffer
}

/**
 * @brief Récupère les nouveaux octets reçus via DMA UART.
 * @param buffer Buffer de destination.
 * @param buffer_size Taille du buffer de destination.
 * @return Nombre d'octets copiés dans le buffer.
 */
uint16_t esp01_get_new_data(uint8_t *buffer, uint16_t buffer_size)
{
	if (!g_esp_uart || !g_dma_rx_buf || !buffer || buffer_size == 0) // Vérifie les pointeurs et la taille du buffer
	{
		if (buffer && buffer_size > 0)
			buffer[0] = '\0'; // Met fin de chaîne si possible
		return 0;			  // Rien à lire
	}

	uint16_t available = _get_available_bytes(); // Récupère le nombre d'octets disponibles dans le buffer DMA
	if (available == 0)
	{
		buffer[0] = '\0'; // Met fin de chaîne
		return 0;		  // Aucun octet à lire
	}

	uint16_t to_copy = (available < buffer_size - 1) ? available : buffer_size - 1; // Nombre d'octets à copier (en laissant la place pour '\0')
	uint16_t copied = 0;															// Compteur d'octets copiés
	uint16_t write_pos = _get_dma_write_pos();										// Position d'écriture actuelle du DMA

	// Cas où les données ne sont pas fragmentées dans le buffer circulaire
	if (write_pos > g_rx_last_pos)
	{
		memcpy(buffer, &g_dma_rx_buf[g_rx_last_pos], to_copy); // Copie directe
		copied = to_copy;
	}
	else
	{
		// Cas où les données sont fragmentées (fin du buffer circulaire)
		uint16_t first_chunk = g_dma_buf_size - g_rx_last_pos; // Taille du premier morceau (jusqu'à la fin du buffer)
		if (first_chunk >= to_copy)
		{
			memcpy(buffer, &g_dma_rx_buf[g_rx_last_pos], to_copy); // Tout tient dans le premier morceau
			copied = to_copy;
		}
		else
		{
			memcpy(buffer, &g_dma_rx_buf[g_rx_last_pos], first_chunk); // Copie la fin du buffer
			copied = first_chunk;
			uint16_t remaining = to_copy - first_chunk; // Reste à copier depuis le début du buffer
			if (remaining > 0)
			{
				memcpy(buffer + first_chunk, &g_dma_rx_buf[0], remaining); // Copie le début du buffer
				copied += remaining;
			}
		}
	}

	buffer[copied] = '\0';									   // Ajoute le caractère de fin de chaîne
	g_rx_last_pos = (g_rx_last_pos + copied) % g_dma_buf_size; // Met à jour la position de lecture dans le buffer circulaire

	if (copied > 0)
	{
		char dbg[ESP01_MAX_DBG_BUF];
		snprintf(dbg, sizeof(dbg), "[GET NEW DATA]  %u octets reçus", copied); // Message de debug
		_esp_logln(dbg);
	}

	return copied; // Retourne le nombre d'octets copiés
}

/**
 * @brief Accumule les données reçues et cherche un motif (pattern) dans l'accumulateur.
 * @param pattern Motif à rechercher.
 * @param timeout_ms Timeout en millisecondes.
 * @param clear_first Si vrai, vide l'accumulateur avant de commencer.
 * @return true si le motif est trouvé, false sinon (timeout).
 */
bool _accumulate_and_search(const char *pattern, uint32_t timeout_ms, bool clear_first)
{
	uint32_t start_tick = HAL_GetTick(); // Début du timeout
	char temp_buf[ESP01_TMP_BUF_SIZE];	 // Buffer temporaire pour les nouveaux octets

	if (clear_first) // Si on doit vider l'accumulateur
	{
		g_acc_len = 0;			 // Vide la longueur de l'accumulateur
		g_accumulator[0] = '\0'; // Vide le contenu de l'accumulateur
	}

	while ((HAL_GetTick() - start_tick) < timeout_ms) // Boucle jusqu'au timeout
	{
		uint16_t new_data = esp01_get_new_data((uint8_t *)temp_buf, sizeof(temp_buf)); // Récupère les nouveaux octets
		if (new_data > 0)															   // Si des octets ont été reçus
		{
			uint16_t space_left = sizeof(g_accumulator) - g_acc_len - 1;	   // Espace restant dans l'accumulateur
			uint16_t to_add = (new_data < space_left) ? new_data : space_left; // Nombre d'octets à ajouter
			if (to_add > 0)													   // Si on peut ajouter des octets
			{
				memcpy(&g_accumulator[g_acc_len], temp_buf, to_add); // Ajoute les octets reçus à l'accumulateur
				g_acc_len += to_add;								 // Met à jour la longueur de l'accumulateur
				g_accumulator[g_acc_len] = '\0';					 // Termine la chaîne
			}
			if (strstr(g_accumulator, pattern)) // Cherche le motif dans l'accumulateur
				return true;					// Motif trouvé, retourne vrai
		}
		else // Si aucun nouvel octet reçu
		{
			HAL_Delay(10); // Petite pause avant de réessayer
		}
	}
	return false; // Timeout sans trouver le motif
}

/**
 * @brief Vide le buffer RX UART/DMA pendant un certain temps (utilisé pour nettoyer avant une commande AT)
 * @param timeout_ms Durée en millisecondes
 */
static void _flush_rx_buffer(uint32_t timeout_ms)
{
	char temp_buf[ESP01_TMP_BUF_SIZE];	 // Buffer temporaire pour vider les octets
	uint32_t start_time = HAL_GetTick(); // Début du timeout

