weedmanu/STM32_Libraries/STM32_WifiESP_Alexa/STM32_WifiESP_Alexa.c
	while ((HAL_GetTick() - start_time) < timeout_ms) // Boucle jusqu'à la fin du timeout
	{
		uint16_t len = esp01_get_new_data((uint8_t *)temp_buf, sizeof(temp_buf)); // Vide les nouveaux octets reçus
		if (len == 0)															  // Si aucun octet reçu
		{
			HAL_Delay(10); // Petite pause avant de réessayer
		}
		else // Si des octets ont été lus
		{
			if (ESP01_DEBUG) // Si le debug est activé
			{
				temp_buf[len] = '\0';		// Termine la chaîne pour affichage
				_esp_logln("Buffer vidé:"); // Message debug
				_esp_logln(temp_buf);		// Affiche le contenu vidé
			}
		}
	}
}

/**
 * @brief Cherche le prochain +IPD valide dans un buffer (pour resynchroniser en cas de trame corrompue)
 * @param buffer Buffer à analyser
 * @param buffer_len Taille du buffer
 * @return Pointeur sur le début du prochain +IPD, ou NULL si non trouvé
 */
static char *_find_next_ipd(char *buffer, int buffer_len)
{
	char *search_pos = buffer; // Position de recherche actuelle dans le buffer
	char *ipd_pos;			   // Pointeur temporaire pour le prochain "+IPD,"

	while ((ipd_pos = strstr(search_pos, "+IPD,")) != NULL) // Recherche la prochaine occurrence de "+IPD,"
	{
		// Vérifie la présence du ':' après "+IPD,"
		char *colon = strchr(ipd_pos, ':');				// Cherche le caractère ':' après "+IPD,"
		if (colon && (colon - buffer) < buffer_len - 1) // Vérifie que ':' est bien dans la fenêtre du buffer
		{
			return ipd_pos; // Si trouvé, retourne le pointeur sur "+IPD,"
		}
		// Continue la recherche après ce "+IPD," invalide
		search_pos = ipd_pos + IPD_HEADER_MIN_LEN; // Avance la position de recherche d'au moins la taille minimale d'un header IPD
	}
	return NULL; // Aucun "+IPD," valide trouvé dans le buffer
}

/**
 * @brief Parse un header IPD brut pour extraire les infos de connexion
 * @param data Chaîne contenant le header IPD
 * @return Structure http_request_t remplie
 */
static http_request_t parse_ipd_header(const char *data)
{
	http_request_t request = {0}; // Initialise la structure à zéro

	char *ipd_start = strstr(data, "+IPD,"); // Cherche le début du header +IPD
	if (!ipd_start)							 // Si non trouvé
	{
		_esp_logln("parse_ipd_header: +IPD non trouvé"); // Log d'erreur
		return request;									 // Retourne une structure invalide
	}

	// Tente de parser le format complet : +IPD,<id>,<len>,"<ip>",<port>:
	int parsed = sscanf(ipd_start, "+IPD,%d,%d,\"%15[0-9.]\",%d:",
						&request.conn_id,		 // ID de connexion
						&request.content_length, // Longueur du payload
						request.client_ip,		 // IP du client
						&request.client_port);	 // Port du client
	if (parsed == 4)							 // Si tous les champs sont trouvés
	{
		request.is_valid = true; // Marque la structure comme valide
		request.has_ip = true;	 // Indique que l'IP est présente
		char dbg[ESP01_MAX_DBG_BUF];
		snprintf(dbg, sizeof(dbg),
				 "[PARSE] parse_ipd_header: IPD avec IP %s:%d, conn_id=%d, len=%d",
				 request.client_ip, request.client_port, request.conn_id, request.content_length); // Prépare un message de debug
		_esp_logln(dbg);																		   // Affiche le message de debug
	}
	else
	{
		// Tente de parser le format court : +IPD,<id>,<len>:
		parsed = sscanf(ipd_start, "+IPD,%d,%d:",
						&request.conn_id,		  // ID de connexion
						&request.content_length); // Longueur du payload
		if (parsed == 2)						  // Si les deux champs sont trouvés
		{
			request.is_valid = true; // Marque la structure comme valide
			request.has_ip = false;	 // Indique que l'IP n'est pas présente
			char dbg[ESP01_MAX_DBG_BUF];
			snprintf(dbg, sizeof(dbg),
					 "[PARSE] parse_ipd_header: IPD sans IP, conn_id=%d, len=%d",
					 request.conn_id, request.content_length); // Prépare un message de debug
			_esp_logln(dbg);								   // Affiche le message de debug
		}
		else
		{
			_esp_logln("[PARSE] parse_ipd_header: format IPD non reconnu"); // Format non reconnu
		}
	}
	return request; // Retourne la structure remplie (ou invalide)
}

/**
 * @brief Définit le mode WiFi (STA/AP)
 * @param mode Mode WiFi à utiliser
 * @return ESP01_OK si succès, code d'erreur sinon
 */
static ESP01_Status_t esp01_set_wifi_mode(ESP01_WifiMode_t mode)
{
	char cmd[ESP01_MAX_CMD_BUF], resp[ESP01_MAX_CMD_BUF * 2];					// Buffers pour la commande AT et la réponse
	snprintf(cmd, sizeof(cmd), "AT+CWMODE=%d", mode);							// Prépare la commande AT pour définir le mode WiFi
	ESP01_Status_t status = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), // Envoie la commande AT et attend "OK"
													   "OK", ESP01_TIMEOUT_MEDIUM);
	return status; // Retourne le statut de l'opération
}

/**
 * @brief Connecte l'ESP01 à un réseau WiFi (STA)
 * @param ssid SSID du réseau WiFi
 * @param password Mot de passe du réseau WiFi
 * @return ESP01_OK si succès, code d'erreur sinon
 */
static ESP01_Status_t esp01_connect_wifi(const char *ssid, const char *password)
{
	char cmd[ESP01_MAX_CMD_BUF], resp[ESP01_MAX_CMD_BUF * 2];			  // Buffers pour la commande AT et la réponse
	snprintf(cmd, sizeof(cmd), "AT+CWJAP=\"%s\",\"%s\"", ssid, password); // Prépare la commande AT pour rejoindre le réseau WiFi
	ESP01_Status_t status = esp01_send_raw_command_dma(					  // Envoie la commande AT et attend la réponse
		cmd,															  // Commande AT à envoyer
		resp,															  // Buffer pour la réponse
		sizeof(resp),													  // Taille du buffer réponse
		"OK",															  // Motif attendu pour succès
		ESP01_TIMEOUT_WIFI);											  // Timeout pour la connexion WiFi
	return status;														  // Retourne le statut de la connexion
}

/**
 * @brief Attend un motif précis dans le flux RX (avec timeout)
 * @param pattern Motif à attendre
 * @param timeout_ms Timeout en millisecondes
 * @return ESP01_OK si trouvé, ESP01_TIMEOUT sinon
 */
ESP01_Status_t esp01_wait_for_pattern(const char *pattern, uint32_t timeout_ms)
{
	// Appelle la fonction interne pour accumuler et rechercher le motif dans le flux RX
	if (_accumulate_and_search(pattern, timeout_ms, false)) // Si le motif est trouvé dans le délai imparti
		return ESP01_OK;									//   -> Retourne OK
	return ESP01_TIMEOUT;									// Sinon, retourne TIMEOUT
}

/***************************************************************/
// Fonctions utilisateur pour le driver ESP01
/***************************************************************/

