weedmanu/STM32_Libraries/STM32_WifiESP_Alexa/STM32_WifiESP_Alexa.c
// ==================== DRIVER ====================
/**
 * @brief Vide le buffer RX UART/DMA pendant un certain temps (externe)
 * @param timeout_ms Durée en millisecondes
 * @return ESP01_OK toujours
 */
ESP01_Status_t esp01_flush_rx_buffer(uint32_t timeout_ms)
{
	_flush_rx_buffer(timeout_ms);		  // Appelle la fonction interne pour vider le buffer RX
	_esp_logln("[ESP01] Buffer RX vidé"); // Log de succès
	return ESP01_OK;					  // Retourne OK
}

/**
 * @brief Initialise le driver ESP01 (UART, debug UART, buffer DMA, taille buffer)
 * @param huart_esp UART pour l'ESP01
 * @param huart_debug UART pour debug
 * @param dma_rx_buf Buffer DMA RX
 * @param dma_buf_size Taille du buffer DMA RX
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_init(UART_HandleTypeDef *huart_esp, UART_HandleTypeDef *huart_debug,
						  uint8_t *dma_rx_buf, uint16_t dma_buf_size)
{
	_esp_logln("[ESP01] Initialisation UART/DMA pour ESP01");
	g_esp_uart = huart_esp;					   // UART pour l'ESP01
	g_debug_uart = huart_debug;				   // UART pour le debug
	g_dma_rx_buf = dma_rx_buf;				   // Buffer DMA
	g_dma_buf_size = dma_buf_size;			   // Taille buffer
	g_rx_last_pos = 0;						   // Reset position
	g_acc_len = 0;							   // Reset accumulateur
	g_accumulator[0] = '\0';				   // Vide l'accumulateur
	g_parse_state = PARSE_STATE_SEARCHING_IPD; // Reset l'état de parsing

	if (!g_esp_uart || !g_dma_rx_buf || g_dma_buf_size == 0) // Vérifie les pointeurs et la taille du buffer
	{
		_esp_logln("[ESP01] ESP01 Init Error: Invalid params"); // Log d'erreur
		return ESP01_NOT_INITIALIZED;							// Retourne erreur d'initialisation
	}

	// Lance la réception DMA
	if (HAL_UART_Receive_DMA(g_esp_uart, g_dma_rx_buf, g_dma_buf_size) != HAL_OK)
	{
		_esp_logln("[ESP01] ESP01 Init Error: HAL_UART_Receive_DMA failed"); // Log d'erreur
		return ESP01_FAIL;													 // Retourne échec de l'initialisation
	}

	_esp_logln("[ESP01] --- ESP01 Driver Init OK ---"); // Log de succès
	HAL_Delay(100);										// Court délai pour stabiliser l'initialisation
	return ESP01_OK;									// Retourne succès
}

/**
 * @brief Envoie une commande AT et récupère la réponse (DMA, timeout, etc.)
 * @param cmd Commande AT à envoyer
 * @param response_buffer Buffer pour la réponse
 * @param max_response_size Taille max du buffer réponse
 * @param expected_terminator Motif attendu pour la fin de réponse
 * @param timeout_ms Timeout en millisecondes
 * @return ESP01_OK si motif trouvé, ESP01_TIMEOUT sinon
 */
ESP01_Status_t esp01_send_raw_command_dma(const char *cmd, char *response_buffer,
										  uint32_t max_response_size,
										  const char *expected_terminator,
										  uint32_t timeout_ms)
{
	if (!g_esp_uart || !cmd || !response_buffer) // Vérifie les pointeurs nécessaires
		return ESP01_NOT_INITIALIZED;

	const char *terminator = expected_terminator ? expected_terminator : "OK"; // Définit le motif de terminaison attendu

	char full_cmd[ESP01_DMA_RX_BUF_SIZE];							   // Buffer pour la commande complète
	int cmd_len = snprintf(full_cmd, sizeof(full_cmd), "%s\r\n", cmd); // Prépare la commande AT avec retour chariot

	_flush_rx_buffer(100); // Vide le buffer RX avant d'envoyer

	if (HAL_UART_Transmit(g_esp_uart, (uint8_t *)full_cmd, cmd_len, ESP01_TIMEOUT_SHORT) != HAL_OK) // Envoie la commande AT
		return ESP01_FAIL;

	bool found = _accumulate_and_search(terminator, timeout_ms, true); // Attend la réponse contenant le motif attendu

	uint32_t copy_len = (g_acc_len < max_response_size - 1) ? g_acc_len : max_response_size - 1; // Détermine la taille à copier
	memcpy(response_buffer, g_accumulator, copy_len);											 // Copie la réponse dans le buffer utilisateur
	response_buffer[copy_len] = '\0';															 // Termine la chaîne

	return found ? ESP01_OK : ESP01_TIMEOUT; // Retourne le statut selon la présence du motif
}

/**
 * @brief Configure la connexion WiFi (mode, SSID, mot de passe, DHCP ou IP statique)
 * @param mode Mode WiFi (STA/AP)
 * @param ssid SSID du réseau
 * @param password Mot de passe
 * @param use_dhcp true pour DHCP, false pour IP statique
 * @param ip Adresse IP statique (si DHCP désactivé)
 * @param gateway Passerelle (si IP statique)
 * @param netmask Masque réseau (si IP statique)
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_connect_wifi_config(
	ESP01_WifiMode_t mode, // Mode WiFi (STA ou AP)
	const char *ssid,	   // SSID du réseau
	const char *password,  // Mot de passe du réseau
	bool use_dhcp,		   // true = DHCP, false = IP statique
	const char *ip,		   // IP statique (si utilisé)
	const char *gateway,   // Passerelle (si IP statique)
	const char *netmask)   // Masque réseau (si IP statique)
{
	ESP01_Status_t status;			  // Code de retour
	char cmd[ESP01_DMA_RX_BUF_SIZE];  // Buffer pour commandes AT
	char resp[ESP01_DMA_RX_BUF_SIZE]; // Buffer pour réponses AT

	_esp_logln("[WIFI] === Début configuration WiFi ==="); // Log début config

	// 1. Définir le mode WiFi (STA ou AP uniquement)
	_esp_logln("[WIFI] -> Définition du mode WiFi..."); // Log changement mode
	status = esp01_set_wifi_mode(mode);					// Définit le mode WiFi
	if (status != ESP01_OK)								// Si erreur
	{
		_esp_logln("[WIFI] !! ERREUR: esp01_set_wifi_mode"); // Log erreur
		return status;										 // Retourne erreur
	}
	HAL_Delay(300); // Délai stabilisation

	// 2. Si AP, configure le point d'accès
	if (mode == ESP01_WIFI_MODE_AP) // Si mode AP
	{
		_esp_logln("[WIFI] -> Configuration du point d'accès (AP)...");
		snprintf(cmd, sizeof(cmd), "AT+CWSAP=\"%s\",\"%s\",5,3", ssid, password);
		status = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), "OK", 2000);
		_esp_logln(resp);
		if (status != ESP01_OK)
		{
			_esp_logln("[WIFI] !! ERREUR: Configuration AP");
			return status;
		}
		HAL_Delay(300); // Délai après config AP

		// --- Correction IP fixe AP ---
		if (ip && strlen(ip) > 0)
		{
			_esp_logln("[WIFI] -> Configuration IP fixe AP...");
			snprintf(cmd, sizeof(cmd), "AT+CIPAP=\"%s\"", ip);
			status = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), "OK", 2000);
			_esp_logln(resp);
			if (status != ESP01_OK)
			{
				_esp_logln("[WIFI] !! ERREUR: Configuration IP AP");
				return status;
			}
		}
	}

	// 3. Configurer DHCP ou IP statique
	if (use_dhcp) // Si DHCP activé
	{
		if (mode == ESP01_WIFI_MODE_STA) // Si mode STA
		{
			_esp_logln("[WIFI] -> Activation du DHCP STA...");									  // Log DHCP STA
			status = esp01_send_raw_command_dma("AT+CWDHCP=1,1", resp, sizeof(resp), "OK", 2000); // Active DHCP STA
		}
		else if (mode == ESP01_WIFI_MODE_AP) // Si mode AP
		{
			_esp_logln("[WIFI] -> Activation du DHCP AP...");									  // Log DHCP AP
			status = esp01_send_raw_command_dma("AT+CWDHCP=2,1", resp, sizeof(resp), "OK", 2000); // Active DHCP AP
		}
		_esp_logln(resp);		// Log réponse
		if (status != ESP01_OK) // Si erreur DHCP
		{
			_esp_logln("[WIFI] !! ERREUR: Activation DHCP"); // Log erreur
			return status;									 // Retourne erreur
		}
	}
	else if (ip && gateway && netmask && mode == ESP01_WIFI_MODE_STA) // Si IP statique en mode STA
	{
		_esp_logln("[WIFI] -> Déconnexion du WiFi (CWQAP)...");					// Log déconnexion WiFi
		esp01_send_raw_command_dma("AT+CWQAP", resp, sizeof(resp), "OK", 2000); // Déconnecte WiFi

