weedmanu/STM32_Libraries/STM32_WifiESP_Alexa/STM32_WifiESP_Alexa.c
		_esp_logln("[WIFI] -> Désactivation du DHCP client...");							  // Log désactivation DHCP
		status = esp01_send_raw_command_dma("AT+CWDHCP=0,1", resp, sizeof(resp), "OK", 2000); // Désactive DHCP
		_esp_logln(resp);																	  // Log réponse
		if (status != ESP01_OK)																  // Si erreur DHCP off
		{
			_esp_logln("[WIFI] !! ERREUR: Désactivation DHCP"); // Log erreur
			return status;										// Retourne erreur
		}
		_esp_logln("[WIFI] -> Configuration IP statique...");								// Log config IP statique
		snprintf(cmd, sizeof(cmd), "AT+CIPSTA=\"%s\",\"%s\",\"%s\"", ip, gateway, netmask); // Prépare commande IP statique
		status = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), "OK", 2000);			// Envoie commande IP statique
		_esp_logln(resp);																	// Log réponse
		if (status != ESP01_OK)																// Si erreur IP statique
		{
			_esp_logln("[WIFI] !! ERREUR: Configuration IP statique"); // Log erreur
			return status;											   // Retourne erreur
		}
	}

	// 4. Connexion au réseau WiFi (STA uniquement)
	if (mode == ESP01_WIFI_MODE_STA) // Si le mode est STA (client WiFi)
	{
		_esp_logln("[WIFI] -> Connexion au réseau WiFi..."); // Log : début de la connexion WiFi
		status = esp01_connect_wifi(ssid, password);		 // Appelle la fonction de connexion WiFi
		if (status != ESP01_OK)								 // Si la connexion échoue
		{
			_esp_logln("[WIFI] !! ERREUR: Connexion WiFi (CWJAP)"); // Log : erreur de connexion WiFi
			return status;											// Retourne le code d'erreur
		}
		HAL_Delay(300); // Délai après la connexion pour stabiliser
	}

	// 5. Activation de l'affichage IP client dans +IPD
	_esp_logln("[WIFI] -> Activation de l'affichage IP client dans +IPD (AT+CIPDINFO=1)..."); // Log : activation de l'affichage IP client
	status = esp01_send_raw_command_dma("AT+CIPDINFO=1", resp, sizeof(resp), "OK", 2000);	  // Envoie la commande AT pour activer CIPDINFO
	_esp_logln(resp);																		  // Log : affiche la réponse reçue
	if (status != ESP01_OK)																	  // Si la commande échoue
	{
		_esp_logln("[WIFI] !! ERREUR: AT+CIPDINFO=1"); // Log : erreur d'activation CIPDINFO
		return status;								   // Retourne le code d'erreur
	}

	_esp_logln("[WIFI] === Configuration WiFi terminée ==="); // Log : fin de la configuration WiFi
	return ESP01_OK;										  // Retourne OK
}

/**
 * @brief Démarre le serveur web sur le port spécifié
 * @param multi_conn true pour multi-connexion, false pour mono
 * @param port Port du serveur web
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_start_server_config(
	bool multi_conn, // true = multi-connexion (CIPMUX=1), false = mono (CIPMUX=0)
	uint16_t port)	 // Port du serveur web
{
	g_server_port = port;			  // Stocke le port du serveur web
	ESP01_Status_t status;			  // Variable pour le code de retour
	char resp[ESP01_DMA_RX_BUF_SIZE]; // Buffer pour la réponse AT
	char cmd[ESP01_DMA_RX_BUF_SIZE];  // Buffer pour la commande AT

	// 1. Configure le mode multi-connexion
	snprintf(cmd, sizeof(cmd), "AT+CIPMUX=%d", multi_conn ? 1 : 0);			  // Prépare la commande pour activer/désactiver le multi-connexion
	status = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), "OK", 3000); // Envoie la commande AT+CIPMUX
	if (status != ESP01_OK)													  // Si la commande échoue
	{
		_esp_logln("[WEB] ERREUR: AT+CIPMUX"); // Log : erreur AT+CIPMUX
		return status;						   // Retourne le code d'erreur
	}

	// 2. Démarre le serveur web sur le port demandé
	snprintf(cmd, sizeof(cmd), "AT+CIPSERVER=1,%u", port);					  // Prépare la commande pour démarrer le serveur web
	status = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), "OK", 5000); // Envoie la commande AT+CIPSERVER
	if (status != ESP01_OK && !strstr(resp, "no change"))					  // Si la commande échoue et que la réponse n'est pas "no change"
	{
		_esp_logln("[WEB] ERREUR: AT+CIPSERVER"); // Log : erreur AT+CIPSERVER
		return status;							  // Retourne le code d'erreur
	}

	_esp_logln("[WEB] Serveur web démarré avec succès"); // Log : serveur web démarré
	return ESP01_OK;									 // Retourne OK
}

/**
 * @brief Parse une requête HTTP (GET/POST) et remplit la structure correspondante
 * @param raw_request Chaîne contenant la requête HTTP brute
 * @param parsed Structure de sortie
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_parse_http_request(const char *raw_request, http_parsed_request_t *parsed)
{
	VALIDATE_PARAM(raw_request, ESP01_FAIL); // Vérifie que la requête n'est pas NULL
	VALIDATE_PARAM(parsed, ESP01_FAIL);		 // Vérifie que la structure de sortie n'est pas NULL

	memset(parsed, 0, sizeof(http_parsed_request_t)); // Initialise la structure de sortie à zéro

	// Machine à états pour parser la première ligne HTTP
	const char *p = raw_request;					   // Pointeur de parcours de la requête
	const char *method_start = p, *method_end = NULL;  // Début et fin de la méthode HTTP
	const char *path_start = NULL, *path_end = NULL;   // Début et fin du chemin HTTP
	const char *query_start = NULL, *query_end = NULL; // Début et fin de la query string
	const char *line_end = strstr(p, "\r\n");		   // Cherche la fin de la première ligne
	if (!line_end)									   // Si pas de fin de ligne trouvée
		return ESP01_FAIL;							   // Retourne une erreur

	// État 1 : méthode
	while (p < line_end && *p != ' ')								 // Parcourt jusqu'à l'espace (fin de la méthode)
		p++;														 // Avance le pointeur
	method_end = p;													 // Marque la fin de la méthode
	if (method_end - method_start >= ESP01_MAX_HTTP_METHOD_LEN)		 // Vérifie la taille de la méthode
		return ESP01_FAIL;											 // Retourne une erreur si trop long
	memcpy(parsed->method, method_start, method_end - method_start); // Copie la méthode dans la structure
	parsed->method[method_end - method_start] = '\0';				 // Termine la chaîne

	// État 2 : chemin
	p++;													 // Passe l'espace
	path_start = p;											 // Début du chemin
	while (p < line_end && *p != ' ' && *p != '?')			 // Parcourt jusqu'à l'espace ou '?'
		p++;												 // Avance le pointeur
	path_end = p;											 // Fin du chemin
	if (path_end - path_start >= ESP01_MAX_HTTP_PATH_LEN)	 // Vérifie la taille du chemin
		return ESP01_FAIL;									 // Retourne une erreur si trop long
	memcpy(parsed->path, path_start, path_end - path_start); // Copie le chemin dans la structure
	parsed->path[path_end - path_start] = '\0';				 // Termine la chaîne

	// État 3 : query string (optionnel)
	if (*p == '?') // Si un '?' est présent (query string)
	{
		p++;											 // Passe le '?'
		query_start = p;								 // Début de la query string
		while (p < line_end && *p != ' ')				 // Parcourt jusqu'à l'espace
			p++;										 // Avance le pointeur
		query_end = p;									 // Fin de la query string
		size_t qlen = query_end - query_start;			 // Calcule la longueur de la query string
		if (qlen >= ESP01_MAX_HTTP_QUERY_LEN)			 // Vérifie la taille maximale
			qlen = ESP01_MAX_HTTP_QUERY_LEN - 1;		 // Tronque si nécessaire
		memcpy(parsed->query_string, query_start, qlen); // Copie la query string
		parsed->query_string[qlen] = '\0';				 // Termine la chaîne
	}
	else
	{
		parsed->query_string[0] = '\0'; // Pas de query string
	}

	parsed->is_valid = true; // Marque la structure comme valide
	return ESP01_OK;		 // Retourne OK
}

/**
 * @brief Envoie une réponse HTTP générique (code, type, body)
 * @param conn_id ID de la connexion
 * @param status_code Code HTTP (ex: 200, 404)
 * @param content_type Type MIME
 * @param body Corps de la réponse
 * @param body_len Taille du corps
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_send_http_response(int conn_id, int status_code, const char *content_type,
										const char *body, size_t body_len)
{
	VALIDATE_PARAM(conn_id >= 0, ESP01_FAIL);							 // Vérifie que l'ID de connexion est valide
	VALIDATE_PARAM(status_code >= 100 && status_code < 600, ESP01_FAIL); // Vérifie que le code HTTP est valide
	VALIDATE_PARAM(body || body_len == 0, ESP01_FAIL);					 // Vérifie que le body est non NULL si body_len > 0

	uint32_t start = HAL_GetTick();								// Sauvegarde le temps de début
	g_stats.total_requests++;									// Incrémente le nombre total de requêtes
	g_stats.response_count++;									// Incrémente le nombre de réponses
	if (status_code >= ESP01_HTTP_OK_CODE && status_code < 300) // Si code 2xx
	{
		g_stats.successful_responses++; // Incrémente les réponses réussies
	}
	else if (status_code >= 400) // Si code 4xx ou 5xx
	{
		g_stats.failed_responses++; // Incrémente les réponses échouées
	}

	char header[ESP01_MAX_HEADER_LINE]; // Buffer pour l'entête HTTP
	const char *status_text = "OK";		// Texte du statut HTTP
	switch (status_code)				// Sélectionne le texte selon le code
	{
	case ESP01_HTTP_OK_CODE:
		status_text = "OK"; // 200 -> OK
		break;
	case ESP01_HTTP_NOT_FOUND_CODE:
		status_text = "Not Found"; // 404 -> Not Found
		break;
	case ESP01_HTTP_INTERNAL_ERR_CODE:
		status_text = "Internal Server Error"; // 500 -> Internal Server Error
		break;
	default:
		status_text = "Unknown"; // Autres -> Unknown
		break;
	}

	int header_len = snprintf(header, sizeof(header), // Génère l'entête HTTP
							  "HTTP/1.1 %d %s\r\n"
							  "Content-Type: %s\r\n"
							  "Content-Length: %d\r\n"
							  "Connection: close\r\n"
							  "\r\n",
							  status_code, status_text, content_type ? content_type : "text/html", (int)body_len);

	// Utilise un buffer fixe de 2048 octets pour la réponse HTTP
	char response[ESP01_MAX_TOTAL_HTTP];			 // Buffer pour la réponse complète
	if ((header_len + body_len) >= sizeof(response)) // Vérifie la taille totale
	{
		_esp_logln("[HTTP] esp01_send_http_response: réponse trop grande"); // Log si trop grand
		return ESP01_FAIL;													// Retourne erreur
	}

	memcpy(response, header, header_len);			   // Copie l'entête dans le buffer
	if (body && body_len > 0)						   // Si body présent
		memcpy(response + header_len, body, body_len); // Copie le body après l'entête

