weedmanu/STM32_Libraries/STM32_WifiESP_Alexa/STM32_WifiESP_Alexa.c
	int total_len = header_len + (int)body_len; // Calcule la taille totale

	char cipsend_cmd[ESP01_MAX_CIPSEND_BUF];											// Buffer pour la commande AT+CIPSEND
	snprintf(cipsend_cmd, sizeof(cipsend_cmd), "AT+CIPSEND=%d,%d", conn_id, total_len); // Prépare la commande

	char resp[ESP01_CMD_RESP_BUF_SIZE];																		  // Buffer pour la réponse AT
	ESP01_Status_t st = esp01_send_raw_command_dma(cipsend_cmd, resp, sizeof(resp), ">", ESP01_TIMEOUT_LONG); // Envoie AT+CIPSEND
	if (st != ESP01_OK)																						  // Si échec
	{
		_esp_logln("[HTTP] esp01_send_http_response: AT+CIPSEND échoué"); // Log erreur
		return st;														  // Retourne le code d'erreur
	}

	HAL_UART_Transmit(g_esp_uart, (uint8_t *)response, total_len, HAL_MAX_DELAY); // Envoie la réponse HTTP

	st = esp01_wait_for_pattern("SEND OK", ESP01_TIMEOUT_LONG); // Attend la confirmation d'envoi
	char dbg[ESP01_SMALL_BUF_SIZE];								// Buffer debug
	snprintf(dbg, sizeof(dbg), "[HTTP] Envoi réponse HTTP sur connexion %d, taille de la page HTML : %d octets", conn_id, (int)body_len);
	_esp_logln(dbg); // Log debug

	// À la toute fin, après l'envoi :
	uint32_t elapsed = HAL_GetTick() - start;																			   // Calcule le temps écoulé
	g_stats.total_response_time_ms += elapsed;																			   // Ajoute au temps total
	g_stats.avg_response_time_ms = g_stats.response_count ? (g_stats.total_response_time_ms / g_stats.response_count) : 0; // Met à jour la moyenne

	return st; // Retourne le statut
}

/**
 * @brief Envoie une réponse HTTP JSON (200 OK)
 * @param conn_id ID de la connexion
 * @param json_data Chaîne JSON à envoyer
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_send_json_response(int conn_id, const char *json_data)
{
	_esp_logln("[HTTP] Envoi d'une réponse JSON");													 // Log debug
	return esp01_send_http_response(conn_id, 200, "application/json", json_data, strlen(json_data)); // Envoie la réponse JSON
}

/**
 * @brief Envoie une réponse HTTP 404 Not Found
 * @param conn_id ID de la connexion
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_send_404_response(int conn_id)
{
	_esp_logln("[HTTP] Envoi d'une réponse 404");									// Log debug
	const char *body = ESP01_HTTP_404_BODY;											// Corps HTML 404
	return esp01_send_http_response(conn_id, 404, "text/html", body, strlen(body)); // Envoie la réponse 404
}

/**
 * @brief Vérifie si l'ESP01 est connecté au WiFi
 * @return ESP01_OK si connecté, ESP01_FAIL sinon
 */
ESP01_Status_t esp01_get_connection_status(void)
{
	_esp_logln("[STATUS] Vérification du statut de connexion ESP01");															// Log debug
	char response[ESP01_DMA_RX_BUF_SIZE];																						// Buffer pour la réponse AT
	ESP01_Status_t status = esp01_send_raw_command_dma("AT+CIPSTATUS", response, sizeof(response), "OK", ESP01_TIMEOUT_MEDIUM); // Envoie AT+CIPSTATUS

	if (status == ESP01_OK) // Si succès
	{
		if (strstr(response, "STATUS:2") || strstr(response, "STATUS:3")) // Si status connecté
		{
			_esp_logln("[STATUS] ESP01 connecté au WiFi"); // Log connecté
			return ESP01_OK;							   // Retourne OK
		}
	}

	_esp_logln("[STATUS] ESP01 non connecté au WiFi"); // Log non connecté
	return ESP01_FAIL;								   // Retourne FAIL
}
/**
 * @brief Arrête le serveur web (ferme le port TCP)
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_stop_web_server(void)
{
	_esp_logln("[STATUS] Arrêt du serveur web ESP01");																			  // Log arrêt serveur
	char response[ESP01_DMA_RX_BUF_SIZE];																						  // Buffer pour la réponse AT
	ESP01_Status_t status = esp01_send_raw_command_dma("AT+CIPSERVER=0", response, sizeof(response), "OK", ESP01_TIMEOUT_MEDIUM); // Envoie la commande AT pour arrêter le serveur
	return status;																												  // Retourne le statut
}

/**
 * @brief Affiche le statut de l'ESP01 sur un terminal UART
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_print_connection_status(void)
{
	if (!g_debug_uart) // Vérifie que l'UART debug est initialisée
	{
		_esp_logln("[STATUS] esp01_print_connection_status: g_debug_uart NULL"); // Log erreur
		return ESP01_NOT_INITIALIZED;											 // Retourne erreur
	}

	const char *header = "=== STATUS ESP01 ===\r\n";								   // Entête pour affichage
	HAL_UART_Transmit(g_debug_uart, (uint8_t *)header, strlen(header), HAL_MAX_DELAY); // Affiche l'entête

	char response[ESP01_DMA_RX_BUF_SIZE];															  // Buffer pour la réponse AT
	ESP01_Status_t status = esp01_send_raw_command_dma("AT", response, sizeof(response), "OK", 2000); // Test AT

	char msg[ESP01_MAX_DBG_BUF];														 // Buffer pour messages
	snprintf(msg, sizeof(msg), "Test AT: %s\r\n", (status == ESP01_OK) ? "OK" : "FAIL"); // Prépare le message de test AT
	HAL_UART_Transmit(g_debug_uart, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);		 // Affiche le résultat du test AT

	status = esp01_send_raw_command_dma("AT+CWJAP?", response, sizeof(response), "OK", 3000); // Demande le statut WiFi
	if (status == ESP01_OK)																	  // Si succès
	{
		if (strstr(response, "No AP")) // Si non connecté
		{
			HAL_UART_Transmit(g_debug_uart, (uint8_t *)"WiFi: Non connecté\r\n", 20, HAL_MAX_DELAY); // Affiche non connecté
		}
		else
		{
			HAL_UART_Transmit(g_debug_uart, (uint8_t *)"WiFi: Connecté\r\n", 16, HAL_MAX_DELAY); // Affiche connecté
		}
	}
	else
	{
		HAL_UART_Transmit(g_debug_uart, (uint8_t *)"WiFi: Status inconnu\r\n", 22, HAL_MAX_DELAY); // Affiche statut inconnu
	}

	char ip[ESP01_IP_BUF_SIZE];							  // Buffer pour l'IP
	if (esp01_get_current_ip(ip, sizeof(ip)) == ESP01_OK) // Récupère l'IP courante
	{
		snprintf(msg, sizeof(msg), "IP: %s\r\n", ip);								 // Prépare le message IP
		HAL_UART_Transmit(g_debug_uart, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY); // Affiche l'IP
	}

	snprintf(msg, sizeof(msg), "Routes définies: %d/%d\r\n", g_route_count, ESP01_MAX_ROUTES); // Prépare le message routes
	HAL_UART_Transmit(g_debug_uart, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);			   // Affiche le nombre de routes

