weedmanu/STM32_Libraries/STM32_WifiESP_Alexa/STM32_WifiESP_Alexa.c
	const char *footer = "==================\r\n";									   // Pied de page
	HAL_UART_Transmit(g_debug_uart, (uint8_t *)footer, strlen(footer), HAL_MAX_DELAY); // Affiche le pied de page
	_esp_logln("[STATUS] Statut ESP01 affiché sur terminal");						   // Log affichage terminé
	return ESP01_OK;																   // Retourne OK
}

/**
 * @brief Traite les requêtes HTTP reçues (dispatcher)
 */
void esp01_process_requests(void)
{
	if (g_processing_request)	 // Vérifie si déjà en traitement
		return;					 // Sort si déjà en cours
	g_processing_request = true; // Marque comme en traitement

	uint8_t buffer[ESP01_DMA_RX_BUF_SIZE];					   // Buffer pour les nouveaux octets reçus
	uint16_t len = esp01_get_new_data(buffer, sizeof(buffer)); // Récupère les nouveaux octets
	if (len == 0)											   // Si rien à lire
	{
		g_processing_request = false; // Libère le flag
		return;						  // Sort
	}

	// Ajoute les nouveaux octets à l'accumulateur global
	if (g_acc_len + len < sizeof(g_accumulator) - 1) // Si l'accumulateur n'est pas plein
	{
		memcpy(g_accumulator + g_acc_len, buffer, len); // Ajoute les octets reçus
		g_acc_len += len;								// Met à jour la longueur
		g_accumulator[g_acc_len] = '\0';				// Termine la chaîne
	}
	else
	{ // Débordement de l'accumulateur
		// Débordement : reset complet
		g_acc_len = 0;							   // Réinitialise la longueur
		g_accumulator[0] = '\0';				   // Vide l'accumulateur
		g_parse_state = PARSE_STATE_SEARCHING_IPD; // Réinitialise l'état de parsing
		g_processing_request = false;			   // Libère le flag
		return;									   // Sort
	}

	bool keep_processing = true; // Flag pour la boucle de traitement
	while (keep_processing)		 // Boucle de traitement
	{
		switch (g_parse_state) // Selon l'état de parsing
		{
		case PARSE_STATE_SEARCHING_IPD: // Recherche d'un +IPD
		{
			char *ipd_start = _find_next_ipd(g_accumulator, g_acc_len); // Cherche le prochain +IPD
			if (!ipd_start)												// Si non trouvé
			{
				keep_processing = false; // Arrête le traitement
				break;					 // Sort du switch
			}
			if (ipd_start != g_accumulator) // Si +IPD n'est pas au début
			{
				int shift = ipd_start - g_accumulator;				  // Calcule le décalage
				memmove(g_accumulator, ipd_start, g_acc_len - shift); // Décale l'accumulateur
				g_acc_len -= shift;									  // Met à jour la longueur
				g_accumulator[g_acc_len] = '\0';					  // Termine la chaîne
			}
			g_parse_state = PARSE_STATE_READING_HEADER; // Passe à la lecture des headers
														// Pas de break, on enchaîne
		}
		case PARSE_STATE_READING_HEADER: // Lecture des headers HTTP
		{
			char *headers_end = strstr(g_accumulator, "\r\n\r\n"); // Cherche la fin des headers
			if (!headers_end)									   // Si non trouvée
			{
				keep_processing = false; // Arrête le traitement
				break;					 // Sort du switch
			}
			http_request_t req = parse_ipd_header(g_accumulator); // Parse le header IPD
			if (!req.is_valid)									  // Si IPD non valide
			{
				// IPD non valide, resynchronisation
				char *next_ipd = _find_next_ipd(g_accumulator + IPD_HEADER_MIN_LEN, g_acc_len - IPD_HEADER_MIN_LEN); // Cherche le prochain +IPD
				if (next_ipd)																						 // Si trouvé
				{
					int shift = next_ipd - g_accumulator;				 // Calcule le décalage
					memmove(g_accumulator, next_ipd, g_acc_len - shift); // Décale l'accumulateur
					g_acc_len -= shift;									 // Met à jour la longueur
					g_accumulator[g_acc_len] = '\0';					 // Termine la chaîne
				}
				else
				{
					g_acc_len = 0;			 // Réinitialise la longueur
					g_accumulator[0] = '\0'; // Vide l'accumulateur
				}
				g_parse_state = PARSE_STATE_SEARCHING_IPD; // Retourne à la recherche d'un +IPD
				keep_processing = false;				   // Arrête le traitement
				break;									   // Sort du switch
			}
			g_parse_state = PARSE_STATE_READING_PAYLOAD; // Passe à la lecture du payload
														 // Pas de break, on enchaîne
		}
		case PARSE_STATE_READING_PAYLOAD: // Lecture du payload HTTP
		{
			http_request_t req = parse_ipd_header(g_accumulator); // Parse le header IPD
			int ipd_payload_len = req.content_length;			  // Récupère la taille du payload
			char *colon_pos = strchr(g_accumulator, ':');		  // Cherche le ':'
			if (!colon_pos)										  // Si non trouvé
			{
				g_parse_state = PARSE_STATE_SEARCHING_IPD; // Retourne à la recherche d'un +IPD
				keep_processing = false;				   // Arrête le traitement
				break;									   // Sort du switch
			}
			// colon_pos points to the ':', payload starts at colon_pos + 1
			char *ipd_payload_start = colon_pos + 1;

			// Calculate the total expected frame length: length of header part + 1 (for colon) + payload length
			int expected_frame_len = (colon_pos - g_accumulator) + 1 + ipd_payload_len;

			// Check if the accumulator contains the full expected frame
			if (g_acc_len < expected_frame_len)
			{
				// Attendre plus de données
				keep_processing = false; // Arrête le traitement
				break;					 // Sort du switch
			}

			// === AJOUT POUR COPIER L'IP DU CLIENT DANS g_connections ===
			int idx = -1; // Index de la connexion
			// Cherche une connexion existante
			for (int i = 0; i < g_connection_count; ++i) // Parcourt les connexions existantes
			{
				if (g_connections[i].conn_id == req.conn_id) // Si l'ID correspond
				{
					idx = i; // Sauvegarde l'index
					break;	 // Sort de la boucle
				}
			}
			// Sinon, cherche un slot inactif à réutiliser
			if (idx == -1) // Si non trouvé
			{
				for (int i = 0; i < g_connection_count; ++i) // Parcourt les connexions
				{
					if (!g_connections[i].is_active) // Si slot inactif
					{
						idx = i;								  // Sauvegarde l'index
						g_connections[idx].conn_id = req.conn_id; // Associe l'ID
						break;									  // Sort de la boucle
					}
				}
			}
			// Sinon, ajoute un nouveau slot si possible
			if (idx == -1 && g_connection_count < ESP01_MAX_CONNECTIONS) // Si pas trouvé et place dispo
			{
				idx = g_connection_count++;				  // Nouvel index
				g_connections[idx].conn_id = req.conn_id; // Associe l'ID
				char dbg[ESP01_MAX_DBG_BUF];
				snprintf(dbg, sizeof(dbg), "[DEBUG] Nouvelle connexion TCP id=%d", req.conn_id); // Message debug
				_esp_logln(dbg);																 // Log debug
			}

			if (idx != -1)
			{													  // Si un slot a été trouvé ou créé
				g_connections[idx].last_activity = HAL_GetTick(); // Met à jour l'activité
				g_connections[idx].is_active = true;			  // Marque comme actif
				if (req.has_ip)									  // Si l'IP est connue
				{
					strncpy(g_connections[idx].client_ip, req.client_ip, ESP01_MAX_IP_LEN); // Copie l'IP client
					g_connections[idx].client_ip[ESP01_MAX_IP_LEN - 1] = '\0';				// Ensure null termination
					char dbg[ESP01_MAX_DBG_BUF];
					snprintf(dbg, sizeof(dbg), "[DEBUG] IP client détectée : %s", req.client_ip); // Message debug
					_esp_logln(dbg);															  // Log debug
				}
				else
				{
					strcpy(g_connections[idx].client_ip, "N/A");			   // Marque IP inconnue
					_esp_logln("[DEBUG] IP client non transmise par l'ESP01"); // Log debug
				}
				g_connections[idx].server_port = req.client_port > 0 ? req.client_port : 80;			// Met à jour le port
				char dbg[ESP01_MAX_DBG_BUF];															// Buffer debug
				snprintf(dbg, sizeof(dbg), "[DEBUG] Port client : %u", g_connections[idx].server_port); // Message debug
				_esp_logln(dbg);																		// Log debug
			}

			// Determine if it's an HTTP request or other data (like UDP)
			bool is_http = false;
			// Check the first few bytes of the payload to see if it looks like an HTTP request
			if (ipd_payload_len > 4) // Minimum length for "GET " or "POST"
			{						 // Minimum length for "GET " or "POST"
				if (strncmp(ipd_payload_start, "GET ", 4) == 0 ||
					strncmp(ipd_payload_start, "POST ", 5) == 0 ||
					strncmp(ipd_payload_start, "PUT ", 4) == 0 ||
					strncmp(colon_pos, "DELETE ", 7) == 0 ||
					strncmp(colon_pos, "HEAD ", 5) == 0)
				{
					is_http = true;
				}
			}

			if (is_http)
			{
				// Parse the HTTP request
				http_parsed_request_t parsed = {0};
				// Pass the payload start to the HTTP parser
				if (esp01_parse_http_request(ipd_payload_start, &parsed) == ESP01_OK && parsed.is_valid)
				{
					// --- Parsing des headers HTTP ---
					const char *first_line_end = strstr(ipd_payload_start, "\r\n"); // Cherche la fin de la première ligne
					if (first_line_end)												// Si trouvée
					{
						const char *headers_start = first_line_end + 2;				 // Début des headers
						const char *headers_end = strstr(headers_start, "\r\n\r\n"); // Fin des headers within payload
						if (headers_end)											 // Si trouvée
						{
							size_t headers_len = headers_end - headers_start; // Longueur des headers
							if (headers_len < sizeof(parsed.headers_buf))	  // Si la taille est correcte
							{
								memcpy(parsed.headers_buf, headers_start, headers_len); // Copie les headers
								parsed.headers_buf[headers_len] = '\0';					// Termine la chaîne
							}
							else
							{
								parsed.headers_buf[0] = '\0'; // Vide si trop long
							}
						}
						else
						{
							parsed.headers_buf[0] = '\0'; // Vide si non trouvé
						}
					}
					else
					{
						parsed.headers_buf[0] = '\0'; // Vide si non trouvé
					}
					// --- Fin parsing headers ---

					esp01_route_handler_t handler = esp01_find_route_handler(parsed.path); // Cherche le handler pour la route
					if (handler)														   // Si trouvé
					{
						handler(req.conn_id, &parsed); // Appelle le handler
					}
					else
					{
						// Réponse 204 No Content pour /favicon.ico
						if (strcmp(parsed.path, ESP01_HTTP_FAVICON_PATH) == 0) // Si favicon
						{
							esp01_send_http_response(req.conn_id, 204, "image/x-icon", NULL, 0); // Réponse 204
						}
						else
						{
							esp01_send_404_response(req.conn_id); // Réponse 404
						}
					}

					// Gère le body si nécessaire (POST/PUT) - assuming body is part of the current frame
					char *headers_end_body = strstr(ipd_payload_start, "\r\n\r\n");
					int headers_len_body = headers_end_body ? (headers_end_body + 4 - colon_pos) : 0;
					int body_len = ipd_payload_len - headers_len_body;
					if ((strcmp(parsed.method, "POST") == 0 || strcmp(parsed.method, "PUT") == 0) && body_len > 0)
					{
						// Body is present in the accumulator after headers_end_body
						// We don't process it here, but it will be removed with the rest of the frame.
					}
				}
				else
				{
					// HTTP parse error - discard the frame
					_esp_logln("[HTTP] HTTP parse error, discarding frame.");
					// The frame removal logic below will handle discarding.
				}
			}
			else
			{
				// Not a standard HTTP method, assume it's a raw UDP packet (like SSDP)
				_esp_logln("[UDP] Potential UDP packet detected."); // Log debug
				// The payload starts at ipd_payload_start
				// We need to pass this payload to a UDP handler
				// The length is ipd_payload_len
				// Note: For UDP, the client_ip and client_port from the +IPD header
				// are the source of the UDP packet, which is what we need for SSDP responses.
				// For TCP, these are the client's IP and port.

				// Pass source IP and port from the parsed request info
				udp_ssdp_handle_packet(req.conn_id, req.client_ip, req.client_port, colon_pos, ipd_payload_len);
			}

			// Remove the processed frame from the accumulator
			int total_to_remove = (colon_pos - g_accumulator) + ipd_payload_len; // Calculate size to remove
			if (g_acc_len >= total_to_remove)
			{																						  // Ensure we don't remove more than we have
				memmove(g_accumulator, g_accumulator + total_to_remove, g_acc_len - total_to_remove); // Shift remaining data
				g_acc_len -= total_to_remove;														  // Update length
				g_accumulator[g_acc_len] = '\0';													  // Null-terminate
				g_parse_state = PARSE_STATE_SEARCHING_IPD;											  // Reset state for next frame
																									  // keep_processing remains true if g_acc_len > 0 after removal
			}
			else
			{
				// Should not happen if ipd_payload_len was correct, but as a safeguard:
				char err_msg[ESP01_MAX_DBG_BUF];
				snprintf(err_msg, sizeof(err_msg), "[ERROR] Accumulator length (%u) less than expected frame size (%u)!", g_acc_len, total_to_remove);
				_esp_logln(err_msg); // Log error with more info
				g_acc_len = 0;
				g_accumulator[0] = '\0';
				g_parse_state = PARSE_STATE_SEARCHING_IPD;
				keep_processing = false; // Stop processing this cycle
			}
			break; // Sort du switch
		}
		default:					 // Cas par défaut
			keep_processing = false; // Arrête le traitement
			break;					 // Sort du switch
		}
	}

