weedmanu/STM32_Libraries/STM32_WifiESP_Alexa/STM32_WifiESP_Alexa.c
	g_processing_request = false; // Libère le flag de traitement
}

// ==================== ROUTAGE HTTP ====================

/**
 * @brief Efface toutes les routes HTTP
 */
void esp01_clear_routes(void)
{
	_esp_logln("[ROUTE] Effacement de toutes les routes HTTP"); // Log effacement des routes
	g_route_count = 0;											// Réinitialise le compteur de routes
}

/**
 * @brief Ajoute une route HTTP (chemin + handler)
 * @param path Chemin HTTP
 * @param handler Fonction handler associée
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_add_route(const char *path, esp01_route_handler_t handler)
{
	VALIDATE_PARAM(path, ESP01_FAIL);							  // Vérifie que le chemin n'est pas NULL
	VALIDATE_PARAM(handler, ESP01_FAIL);						  // Vérifie que le handler n'est pas NULL
	VALIDATE_PARAM(g_route_count < ESP01_MAX_ROUTES, ESP01_FAIL); // Vérifie qu'il reste de la place pour une nouvelle route

	strncpy(g_routes[g_route_count].path, path, sizeof(g_routes[g_route_count].path) - 1); // Copie le chemin dans la structure de route
	g_routes[g_route_count].path[sizeof(g_routes[g_route_count].path) - 1] = '\0';		   // Termine la chaîne par '\0'
	g_routes[g_route_count].handler = handler;											   // Associe le handler à la route
	g_route_count++;																	   // Incrémente le compteur de routes
	char dbg[ESP01_MAX_DBG_BUF];
	snprintf(dbg, sizeof(dbg), "[WEB] Route ajoutée : %s (total %d)", path, g_route_count); // Prépare le message de debug
	_esp_logln(dbg);																		// Affiche le message de debug
	return ESP01_OK;																		// Retourne OK
}

/**
 * @brief Recherche le handler associé à un chemin donné
 * @param path Chemin HTTP
 * @return Pointeur sur le handler, ou NULL si non trouvé
 */
esp01_route_handler_t esp01_find_route_handler(const char *path)
{
	for (int i = 0; i < g_route_count; i++) // Parcourt toutes les routes enregistrées
	{
		if (strcmp(g_routes[i].path, path) == 0) // Compare le chemin avec celui recherché
		{
			char dbg[80];															// Buffer pour message de debug
			snprintf(dbg, sizeof(dbg), "[WEB] Route trouvée pour path : %s", path); // Prépare le message de debug
			_esp_logln(dbg);														// Affiche le message de debug
			return g_routes[i].handler;												// Retourne le handler trouvé
		}
	}
	char dbg[80];																   // Buffer pour message de debug
	snprintf(dbg, sizeof(dbg), "[WEB] Aucune route trouvée pour path : %s", path); // Prépare le message de debug
	_esp_logln(dbg);															   // Affiche le message de debug
	return NULL;																   // Retourne NULL si non trouvé
}

/**
 * @brief Teste la communication AT avec l'ESP01
 * @param dma_rx_buf Buffer DMA RX
 * @param dma_buf_size Taille du buffer DMA RX
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_test_at(void)
{
	char response[ESP01_DMA_RX_BUF_SIZE];															  // Buffer pour la réponse AT
	ESP01_Status_t status = esp01_send_raw_command_dma("AT", response, sizeof(response), "OK", 2000); // Envoie la commande AT et attend "OK"
	return status;																					  // Retourne le statut
}

/**
 * @brief Récupère l'adresse IP courante de l'ESP01
 * @param ip_buffer Buffer de sortie
 * @param buffer_size Taille du buffer
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_get_current_ip(char *ip_buffer, size_t buffer_size)
{
	VALIDATE_PARAM(ip_buffer && buffer_size > 0, ESP01_FAIL); // Vérifie les paramètres

	char response[ESP01_DMA_RX_BUF_SIZE];																				  // Buffer pour la réponse AT
	ESP01_Status_t status = esp01_send_raw_command_dma("AT+CIFSR", response, sizeof(response), "OK", ESP01_TIMEOUT_LONG); // Envoie la commande AT+CIFSR

	if (status != ESP01_OK) // Si la commande a échoué
		return ESP01_FAIL;	// Retourne FAIL

	// Recherche STAIP (mode STA), accepte aussi +CIFSR:STAIP,"..."
	char *ip_line = strstr(response, "STAIP,\"");	   // Cherche "STAIP,\""
	if (!ip_line)									   // Si non trouvé
		ip_line = strstr(response, "+CIFSR:STAIP,\""); // Cherche "+CIFSR:STAIP,\""
	if (!ip_line)									   // Si toujours pas trouvé
		ip_line = strstr(response, "APIP,\"");		   // Cherche "APIP,\""
	if (!ip_line)									   // Si non trouvé
		ip_line = strstr(response, "+CIFSR:APIP,\"");  // Cherche "+CIFSR:APIP,\""

	if (ip_line) // Si une ligne IP a été trouvée
	{
		ip_line = strchr(ip_line, '"'); // Cherche le premier guillemet
		if (ip_line)					// Si trouvé
		{
			ip_line++;								// Passe le premier guillemet
			char *end_quote = strchr(ip_line, '"'); // Cherche le guillemet de fin
			if (end_quote)							// Si trouvé
			{
				size_t ip_len = end_quote - ip_line; // Calcule la longueur de l'IP
				if (ip_len < buffer_size)			 // Si la taille est correcte
				{
					strncpy(ip_buffer, ip_line, ip_len); // Copie l'IP dans le buffer
					ip_buffer[ip_len] = '\0';			 // Termine la chaîne

					return ESP01_OK; // Retourne OK
				}
			}
		}
	}

	_esp_logln("[IP] Adresse IP non trouvée dans la réponse ESP01"); // Log si IP non trouvée
	if (buffer_size > 0)											 // Si le buffer est valide
		ip_buffer[0] = '\0';										 // Met une chaîne vide

	return ESP01_FAIL; // Retourne FAIL
}

/**
 * @brief Envoie une requête HTTP GET et récupère la réponse
 * @param host Hôte distant
 * @param port Port distant
 * @param path Chemin HTTP
 * @param response Buffer pour la réponse
 * @param response_size Taille du buffer réponse
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_http_get(const char *host, uint16_t port, const char *path, char *response, size_t response_size)
{
	char dbg[128];																		// Buffer pour message de debug
	snprintf(dbg, sizeof(dbg), "esp01_http_get: GET http://%s:%u%s", host, port, path); // Prépare le message de debug
	_esp_logln(dbg);																	// Affiche le message de debug

	char cmd[ESP01_DMA_RX_BUF_SIZE];												 // Buffer pour la commande AT
	snprintf(cmd, sizeof(cmd), "AT+CIPSTART=\"TCP\",\"%s\",%d", host, port);		 // Prépare la commande AT+CIPSTART
	char resp[ESP01_DMA_RX_BUF_SIZE];												 // Buffer pour la réponse AT
	if (esp01_send_raw_command_dma(cmd, resp, sizeof(resp), "OK", 5000) != ESP01_OK) // Envoie la commande et vérifie le succès
	{
		_esp_logln("[HTTP] esp01_http_get: AT+CIPSTART échoué"); // Log si échec
		return ESP01_FAIL;										 // Retourne FAIL
	}

	char http_req[ESP01_MAX_HTTP_REQ_BUF]; // Buffer pour la requête HTTP GET
	snprintf(http_req, sizeof(http_req),
			 "GET %s HTTP/1.1\r\nHost: %s\r\nConnection: close\r\n\r\n", path, host); // Prépare la requête GET

	snprintf(cmd, sizeof(cmd), "AT+CIPSEND=%d", (int)strlen(http_req));				//// Prépare la commande AT+CIPSEND
	if (esp01_send_raw_command_dma(cmd, resp, sizeof(resp), ">", 3000) != ESP01_OK) // Envoie la commande et attend le prompt '>'
		return ESP01_FAIL;															// Retourne FAIL

	if (esp01_send_raw_command_dma(http_req, resp, sizeof(resp), "CLOSED", 8000) != ESP01_OK) // Envoie la requête HTTP et attend "CLOSED"
		return ESP01_FAIL;																	  // Retourne FAIL
	// Copie la réponse dans le buffer utilisateur
	if (response && response_size > 0) // Si le buffer de réponse est valide
	{
		strncpy(response, resp, response_size - 1); // Copie la réponse
		response[response_size - 1] = '\0';			// Termine la chaîne
	}

	return ESP01_OK; // Retourne OK
}

/**
 * @brief Retourne une chaîne descriptive pour un code d'erreur ESP01_Status_t
 * @param status Code d'erreur
 * @return Chaîne descriptive
 */
const char *esp01_get_error_string(ESP01_Status_t status)
{
	switch (status) // Sélectionne selon le code d'erreur
	{
	case ESP01_OK:
		return "OK"; // OK
	case ESP01_FAIL:
		return "Echec général"; // Échec général
	case ESP01_TIMEOUT:

		return "Timeout"; // Timeout
	case ESP01_NOT_INITIALIZED:
		return "Non initialisé"; // Non initialisé
	case ESP01_INVALID_PARAM:
		return "Paramètre invalide"; // Paramètre invalide
	case ESP01_BUFFER_OVERFLOW:
		return "Débordement de buffer"; // Débordement de buffer
	case ESP01_WIFI_NOT_CONNECTED:
		return "WiFi non connecté"; // WiFi non connecté
	case ESP01_HTTP_PARSE_ERROR:
		return "Erreur parsing HTTP"; // Erreur parsing HTTP
	case ESP01_ROUTE_NOT_FOUND:
		return "Route non trouvée"; // Route non trouvée
	case ESP01_CONNECTION_ERROR:
		return "Erreur de connexion"; // Erreur de connexion
	case ESP01_MEMORY_ERROR:
		return "Erreur mémoire"; // Erreur mémoire
	default:
		return "Code d'erreur inconnu"; // Code d'erreur inconnu
	}
}

/**
 * @brief Récupère la version AT du firmware ESP01
 * @param version_buf Buffer de sortie
 * @param buf_size Taille du buffer
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_get_at_version(char *version_buf, size_t buf_size)
{
	if (!version_buf || buf_size == 0) // Vérifie les paramètres
		return ESP01_FAIL;			   // Retourne FAIL

	char response[ESP01_DMA_RX_BUF_SIZE] = {0};																			  // Buffer pour la version AT
	ESP01_Status_t status = esp01_send_raw_command_dma("AT+GMR", response, sizeof(response), "OK", ESP01_TIMEOUT_MEDIUM); // Envoie la commande AT+GMR

	if (status != ESP01_OK) // Si la commande a échoué
	{
		version_buf[0] = '\0'; // Met une chaîne vide
		return ESP01_FAIL;	   // Retourne FAIL
	}

	// Cherche la première ligne contenant "AT version:" ou "SDK version:"
	char *start = strstr(response, "AT version:"); // Cherche "AT version:"
	if (!start)									   // Si non trouvé
		start = strstr(response, "SDK version:");  // Cherche "SDK version:"
	if (!start)									   // Si toujours pas trouvé
		start = response;						   // Prend le début de la réponse

	// Copie la première ligne trouvée
	char *end = strchr(start, '\r');						  // Cherche '\r'
	if (!end)												  // Si non trouvé
		end = strchr(start, '\n');							  // Cherche '\n'
	size_t len = end ? (size_t)(end - start) : strlen(start); // Calcule la longueur de la ligne
	if (len >= buf_size)									  // Si trop long
		len = buf_size - 1;									  // Tronque
	strncpy(version_buf, start, len);						  // Copie la version
	version_buf[len] = '\0';								  // Termine la chaîne

	return ESP01_OK; // Retourne OK
}

/**
 * @brief Ferme automatiquement les connexions inactives depuis plus de 30s
 */
void esp01_cleanup_inactive_connections(void)
{
	uint32_t now = HAL_GetTick();				 // Récupère le temps actuel
	for (int i = 0; i < g_connection_count; ++i) // Parcourt toutes les connexions
	{
		if (g_connections[i].is_active && (now - g_connections[i].last_activity > ESP01_CONN_TIMEOUT_MS)) // Si la connexion est inactive trop longtemps
		{
			// Ferme la connexion côté ESP01
			char cmd[ESP01_MAX_CMD_BUF];											// Buffer pour la commande AT
			snprintf(cmd, sizeof(cmd), "AT+CIPCLOSE=%d", g_connections[i].conn_id); // Prépare la commande AT+CIPCLOSE
			char resp[ESP01_CMD_RESP_BUF_SIZE];										// Buffer pour la réponse AT
			esp01_send_raw_command_dma(cmd, resp, sizeof(resp), "OK", 2000);		// Envoie la commande AT+CIPCLOSE

			g_connections[i].is_active = false;					   // Marque la connexion comme inactive
			g_connections[i].conn_id = -1;						   // Réinitialise l'ID de connexion
			g_connections[i].client_ip[0] = '\0';				   // Vide l'IP client
			g_connections[i].server_port = 0;					   // Réinitialise le port serveur
			g_connections[i].client_port = 0;					   // Réinitialise le port client
			_esp_logln("[CONN] Connexion fermée pour inactivité"); // Log fermeture connexion
		}
	}
}

/**
 * @brief Retourne le nombre de connexions actives
 * @return Nombre de connexions actives
 */
int esp01_get_active_connection_count(void)
{
	int count = 0;								 // Compteur de connexions actives
	for (int i = 0; i < g_connection_count; ++i) // Parcourt toutes les connexions
	{
		if (g_connections[i].is_active) // Si la connexion est active
			count++;					// Incrémente le compteur
	}
	return count; // Retourne le nombre de connexions actives
}
